app/controllers/carts_controller.rb

SELECT "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "line_items" ("itemable_type", "itemable_id", "photo_id", "quantity", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["itemable_type", "Cart"], ["itemable_id", 1], ["photo_id", 1], ["quantity", 1], ["price", "88.0"], ["created_at", "2023-11-28 10:40:03.382532"], ["updated_at", "2023-11-28 10:40:03.382532"]]
---
  def add
    @cart = current_user.cart || current_user.create_cart
    photo = Photo.find(params[:photo_id])
    @cart.line_items.create(photo: photo, quantity: 1, price: photo.price)

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
  def remove
    @cart = current_user.cart || current_user.create_cart
    line_item = current_user.cart.line_items.find(params[:line_item_id])