app/controllers/photos_controller.rb

INSERT INTO "photos" ("title", "description", "price", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "lal"], ["description", "lulu"], ["price", "88.0"], ["image_url", ""], ["created_at", "2023-11-28 10:37:37.805049"], ["updated_at", "2023-11-28 10:37:37.805049"]]
---
  def create
    @photo = Photo.new(photo_params)

    respond_to do |format|
      if @photo.save