app/models/user.rb

  def create_cart
    Cart.create(user: self)
---
INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2023-11-28 10:39:47.361032"], ["updated_at", "2023-11-28 10:39:47.361032"]]